emacs/init.org
#+TITLE: Init.org
#+STARTUP: content

* System Bootstrap
** Straight bootstrap
#+begin_src emacs-lisp :tangle init.el
;;──────────────────────────────────────────────────────────
;; Straight bootstrap (must be first)
;;──────────────────────────────────────────────────────────
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        user-emacs-directory))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(setq straight-use-package-by-default t)
#+end_src

** Org (required, explicit, upstream)
#+begin_src emacs-lisp :tangle init.el
  ;;──────────────────────────────────────────────────────────
  ;; Org (required, explicit, upstream)
  ;;──────────────────────────────────────────────────────────
  (straight-use-package
 '(org :type git
       :host git
       :repo "https://git.savannah.gnu.org/git/emacs/org-mode.git"))
(require 'org)
#+end_src

** Leaf 
#+begin_src emacs-lisp :tangle init.el
;;──────────────────────────────────────────────────────────
;; Leaf system
;;──────────────────────────────────────────────────────────
(straight-use-package 'leaf)
(straight-use-package 'leaf-keywords)
(require 'leaf)
(require 'leaf-keywords)
(leaf-keywords-init)
(leaf cus-start
  :doc "builtin core configuration"
  :tag "builtin"
  :custom ((truncate-lines . t)
           (menu-bar-mode . nil)
           (tool-bar-mode . nil)
           (scroll-bar-mode . nil)
           (inhibit-startup-screen . t)
           (initial-scratch-message . nil)
           (ring-bell-function . 'ignore)
           (use-dialog-box . nil)
           (cursor-in-non-selected-windows . nil)
           (frame-title-format . "%b")
           (fringe-mode . 0)
           (mode-line-format . nil)))  ;; hide mode line
#+end_src

** Org Configurati

* Literate Config System
#+begin_src emacs-lisp :tangle init.el
(leaf literate-config-system
  :straight (literate-config-system
             :type git
             :host github
             :repo "CogitoGITHUB/literate-config-system"
             :files ("*.el"))
  :init
  ;; nothing loads yet
  :config
  (literate-config-initialize))
#+end_src
* Org Mapping
+begin_src emacs-lisp :tangle init.el
(leaf org-mapping
  :straight (org-mapping
             :type git
             :host github
             :repo "CogitoGITHUB/org-mapping"
             :files ("*.el"))
  :after org
  :hook (org-mode . org-mapping-mode)
  :config
  (org-mapping-setup-defaults))
+end_src

